[{"title": "Disgraced financier Epstein found dead in cell", "text": "Jeffrey Epstein is found dead while awaiting trial on sex trafficking and conspiracy charges.", "link": "/news/world-us-canada-49306032"}, {"title": "Disgraced financier Epstein found dead in cell", "text": "Jeffrey Epstein is found dead while awaiting trial on sex trafficking and conspiracy charges.", "link": "/news/world-us-canada-49306032"}, {"title": "One million evacuated as deadly typhoon hits China", "text": "Twenty-two are killed and more are missing as powerful Typhoon Lekima hits the south-east coast.", "link": "/news/world-asia-china-49303877"}, {"title": "Dozens dead in Tanzania fuel tanker blast", "text": "At least 60 people died, many of them trying to recover fuel from the overturned vehicle, police say.", "link": "/news/world-africa-49304396"}, {"title": "Walmart panic caused by gun rights 'test'", "text": "The heavily armed man wanted to test his gun rights, despite his wife warning him it was a bad idea.", "link": "/news/world-us-canada-49303879"}, {"title": "North Korea tests 'short-range ballistic missiles'", "text": "What appear to be two short-range ballistic missiles were fired early on Saturday, says South Korea.", "link": "/news/world-asia-49301767"}, {"title": "Video 1 minute 10 secondsTear gas at Kashmir rally India denies happened", "text": "Thousands of people took to the streets in Srinagar – in a protest the Indian government denies happened.", "link": "/news/49306816"}, {"title": "'Lessons to learn' from UK blackout", "text": "The company involved says the power cut affecting nearly 1m people was an \"incredibly rare event\".", "link": "/news/uk-49302996"}, {"title": "Death toll rises to 95 in India monsoon floods", "text": "Hundreds of thousands of people are evacuated amid flooding in southern and western India, reports say.", "link": "/news/world-asia-india-49306246"}, {"title": "Tens of thousands attend huge Moscow protest", "text": "Opposition groups have taken part in a demonstration in Moscow to demand fair local elections.", "link": "/news/world-europe-49305129"}, {"title": "Second explosion hits Danish capital in a week", "text": "The explosion, which damaged a police station, follows another blast earlier this week.", "link": "/news/world-europe-49304356"}, {"title": "'Poop every other day' to save planet - Bolsonaro", "text": "Brazil's president was replying to a journalist's question about agriculture and deforestation.", "link": "/news/world-latin-america-49304358"}, {"title": "Second explosion hits Danish capital in a week", "text": "The explosion, which damaged a police station, follows another blast earlier this week.", "link": "/news/world-europe-49304356"}, {"title": "'Poop every other day' to save planet - Bolsonaro", "text": "Brazil's president was replying to a journalist's question about agriculture and deforestation.", "link": "/news/world-latin-america-49304358"}, {"title": "Video 3 minutes 42 seconds'We moved to the forest to fight climate change'", "text": "Janne Utriainen is tackling climate change in his own way - leaving the city to live off the land.", "link": "/news/world-europe-49295800"}, {"title": "Williams wins rematch but Osaka still number one", "text": "Naomi Osaka will return to the top of the world rankings despite losing to Serena Williams after Karolina Pliskova is beaten in the quarter-finals of the Rogers Cup.", "link": "/sport/tennis/49301393"}, {"title": "Man pushes birthday present BMW into river", "text": "The Indian man was reportedly upset at getting a BMW rather than a Jaguar for his birthday.", "link": "/news/world-asia-india-49305126"}]